app/Http/Controllers/PlayerController.php

    public function detail($id)
    {
        $player = Player::with(['goals.pairing.enemyCountry'])->where('del_flg', 0)->find($id);

        if (!$player) {
            return redirect()->route('player.index')->with('error', '選手が見つかりません。');
---
select count(*) as aggregate from `players` where `del_flg` = 0
select * from `countries` where `countries`.`id` in (1, 10, 11, 12, 13)
select * from `goals` where `goals`.`player_id` in (201)
select * from `pairings` where `pairings`.`id` in (5, 21, 58, 103, 114, 138)
select * from `players` where `players`.`id` = '201' limit 1

    public function delete($id)
    {
        $player = Player::find($id);

        if (!$player) {
            return redirect()->route('player.index')->with('error', '選手が見つかりません。');
        }

        // 論理削除
        $player->del_flg = 1;
        $player->save();

        return redirect()->route('player.index')->with('success', '選手が削除されました。');
---
select * from `players` where `players`.`id` = '266' limit 1
update `players` set `del_flg` = 1 where `id` = 266
select * from `players` where `players`.`id` = '3' limit 1

    public function edit($id)
    {
        $player = Player::where('del_flg', 0)->findOrFail($id);
        $countries = Country::all();
---
select * from `players` where `del_flg` = 0 and `players`.`id` = '11' limit 1
select * from `countries`