app/Models/Player.php

    public static function allPlayers()
    {
        return self::select([
            'p.id',
            'p.country_id',
            'p.uniform_num',
            'p.position',
            'p.name',
            'p.club',
            'p.birth',
            'p.height',
            'p.weight',
            'c.id as country_id',
            'c.name as country_name',
            'c.ranking',
            'c.group_name',
        ])
            ->from('players as p')
            ->join('countries as c', 'p.country_id', '=', 'c.id')
            ->where('p.del_flg', 0)
            ->paginate(20);
---
select `p`.`id`, `p`.`country_id`, `p`.`uniform_num`, `p`.`position`, `p`.`name`, `p`.`club`, `p`.`birth`, `p`.`height`, `p`.`weight`, `c`.`id` as `country_id`, `c`.`name` as `country_name`, `c`.`ranking`, `c`.`group_name` from `players` as `p` inner join `countries` as `c` on `p`.`country_id` = `c`.`id` where `p`.`del_flg` = 0 limit 20 offset 180
select count(*) as aggregate from `players` as `p` inner join `countries` as `c` on `p`.`country_id` = `c`.`id` where `p`.`del_flg` = 0